import {
	Accordion,
	AccordionContent,
	AccordionItem,
	AccordionTrigger
} from '@/components/ui/accordion'

const FAQInfo = [
	{
		id: 1,
		question: 'Як знайти потрібну страву чи заклад?',
		answer:
			'Ви можете скористатися пошуком на головній сторінці, вибрати категорію страв або скористатися фільтрами для швидкого пошуку.'
	},
	{
		id: 2,
		question: 'Скільки часу займає доставка?',
		answer:
			'У середньому доставка займає 30–60 хвилин. Точний час залежить від відстані до вашої адреси та кількості замовлень.'
	},
	{
		id: 3,
		question: 'Чи можна зробити замовлення наперед?',
		answer:
			'Так! Ви можете обрати зручний час доставки під час оформлення замовлення, і ми доставимо точно вчасно.'
	},
	{
		id: 4,
		question: 'Чи є у вас акції або знижки?',
		answer:
			'Так, ми регулярно проводимо акції та надаємо промокоди! Слідкуйте за оновленнями на сайті або в наших соцмережах.'
	},
	{
		id: 5,
		question: 'Як перевірити статус мого замовлення?',
		answer:
			'Після оформлення ви отримаєте SMS або повідомлення в застосунку з посиланням на відстеження замовлення в реальному часі.'
	},
	{
		id: 6,
		question: 'Чи можна оплатити карткою при отриманні?',
		answer:
			'Так, наші кур’єри мають термінали для безконтактної оплати карткою або телефоном.'
	},
	{
		id: 7,
		question: 'Що робити, якщо страва приїхала холодною або пошкодженою?',
		answer:
			'Ми прагнемо ідеальної якості! Якщо страва не відповідає очікуванням — зв’яжіться з підтримкою, і ми обов’язково вирішимо питання (повернення або заміна).'
	},
	{
		id: 8,
		question: 'Чи можна замовити напої разом із суші або піцою?',
		answer:
			'Звісно! Ми маємо великий вибір напоїв — просто додайте їх до кошика під час замовлення.'
	},
	{
		id: 9,
		question: 'Чи доставляєте ви за межі міста?',
		answer:
			'Так, але доставка за місто може мати додаткову вартість або мінімальну суму замовлення. Деталі уточнюйте під час оформлення.'
	},
	{
		id: 10,
		question: 'Як я можу залишити відгук про замовлення?',
		answer:
			'Після отримання замовлення ви отримаєте коротке опитування або можете залишити відгук у профілі користувача — нам важлива ваша думка!'
	}
]

const FAQ = () => {
	return (
		<div className='space-y-[20px]'>
			<h3 className='text-[22px] font-[700]'>Часті запитання</h3>
			<div>
				<Accordion
					className='space-y-[10px]'
					type='single'
					collapsible
					defaultValue='item-1'>
					{FAQInfo.map(faq => (
						<AccordionItem
							key={faq.id}
							value={`item-${faq.id}`}
							className='bg-white rounded-[16px] px-[14px] py-[19px]'>
							<AccordionTrigger className='text-[14px] font-[500] leading-[140%] cursor-pointer'>
								{faq.question}
							</AccordionTrigger>
							<AccordionContent className='text-[14px] font-[400]'>
								{faq.answer}
							</AccordionContent>
						</AccordionItem>
					))}
				</Accordion>
			</div>
		</div>
	)
}

export default FAQ
